{
  "comment": "Font download manifest. Run `uv run scripts/download_fonts.py` to fetch all TTF files into data/fonts/files/. Each entry maps a Google Fonts family to the stem naming used in combinations.json.",

  "weight_map": {
    "comment": "Maps weight name used in filenames to CSS numeric weight.",
    "Thin": 100,
    "ExtraLight": 200,
    "Light": 300,
    "Regular": 400,
    "Medium": 500,
    "SemiBold": 600,
    "Bold": 700,
    "ExtraBold": 800,
    "Black": 900
  },

  "fonts": [
    {
      "dir": "Noto_Sans",
      "families": [
        {
          "google_family": "Noto Sans",
          "stem": "NotoSans",
          "weights": [
            "Thin",
            "ExtraLight",
            "Light",
            "Regular",
            "Medium",
            "SemiBold",
            "Bold",
            "ExtraBold",
            "Black"
          ],
          "italics": [
            "Thin",
            "ExtraLight",
            "Light",
            "Regular",
            "Medium",
            "SemiBold",
            "Bold",
            "ExtraBold",
            "Black"
          ]
        },
        {
          "google_family": "Noto Sans Armenian",
          "stem": "NotoSansArmenian",
          "weights": [
            "Thin",
            "ExtraLight",
            "Light",
            "Regular",
            "Medium",
            "SemiBold",
            "Bold",
            "ExtraBold",
            "Black"
          ]
        },
        {
          "google_family": "Noto Sans SC",
          "stem": "NotoSansSC",
          "weights": [
            "Thin",
            "ExtraLight",
            "Light",
            "Regular",
            "Medium",
            "SemiBold",
            "Bold",
            "ExtraBold",
            "Black"
          ]
        },
        {
          "google_family": "Noto Sans Arabic",
          "stem": "NotoSansArabic",
          "weights": [
            "Thin",
            "ExtraLight",
            "Light",
            "Regular",
            "Medium",
            "SemiBold",
            "Bold",
            "ExtraBold",
            "Black"
          ]
        },
        {
          "google_family": "Noto Sans Bengali",
          "stem": "NotoSansBengali",
          "weights": [
            "Thin",
            "ExtraLight",
            "Light",
            "Regular",
            "Medium",
            "SemiBold",
            "Bold",
            "ExtraBold",
            "Black"
          ]
        },
        {
          "google_family": "Noto Sans Mono",
          "stem": "NotoSansMono",
          "weights": ["Thin", "Regular", "Bold"]
        }
      ]
    },
    {
      "dir": "Roboto",
      "families": [
        {
          "google_family": "Roboto",
          "stem": "Roboto",
          "weights": ["Thin", "Light", "Regular", "Medium", "Bold", "Black"],
          "italics": ["Thin", "Light", "Regular", "Medium", "Bold", "Black"]
        }
      ]
    },
    {
      "dir": "Titillium_Web",
      "families": [
        {
          "google_family": "Titillium Web",
          "stem": "TitilliumWeb",
          "weights": [
            "ExtraLight",
            "Light",
            "Regular",
            "SemiBold",
            "Bold",
            "Black"
          ],
          "italics": ["ExtraLight", "Light", "Regular", "SemiBold", "Bold"]
        }
      ]
    },
    {
      "dir": "Libre_Baskerville",
      "families": [
        {
          "google_family": "Libre Baskerville",
          "stem": "LibreBaskerville",
          "weights": ["Regular", "Bold"],
          "italics": ["Regular"]
        }
      ]
    },
    {
      "dir": "Varela_Round",
      "families": [
        {
          "google_family": "Varela Round",
          "stem": "VarelaRound",
          "weights": ["Regular"]
        }
      ]
    }
  ]
}
